tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "symfony-cli/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", restart_service: true
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Symfony CLI helps Symfony developers manage projects, from local code to remote infrastructure
brew "symfony-cli/tap/symfony-cli"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Typeface made for developers
cask "font-jetbrains-mono"
# Web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Web development solution with Apache, Nginx, PHP & MySQL
cask "mamp"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# PHP IDE by JetBrains
cask "phpstorm"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Native GUI tool for relational databases
cask "tableplus"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# JavaScript IDE
cask "webstorm"
